# 必要なモジュールのimport


"""
メインの実行部分
ツイートデータの取得からデータの出力まで
"""


# today = datetime.date.today()

# 調べる言語のリストの用意


# for文を使って、リストに入っている言語ごとにデータを取得していく

# 取得したデータからデータフレームを作成


# いいね数の総和を求めてリストに追加


# 言語ごとのいいね数を出力する


# 言語名といいね数の情報からデータフレームを作成する
                
#　いいね数の多い順(降順)にデータを並べ変える


# 各種Twitterのキーをセット

# tweepy.Clientでキーをセット


"""
ツイート情報を期間指定で収集
取得できるのデータは直近1週間以内
RT数＋いいね数の合計を超えるツイートを取得
"""

# ツイートデータ取得部分 start_time, end_timeの期間で取得

# response.dataでツイート情報、response.includesで追加の情報を取得

# ツイートのデータを取り出して、リストにまとめていく部分

# いいねとリツイートの合計がrefav_cnt以上の条件

# 空のリストtweet_dataにユーザーネーム、スクリーンネーム、RT数、いい


"""
ツイートデーターからDataframeを作成する
"""


# ツイートデータからユーザー名、ユーザーid、RT数、いいね数、日付け、ツイート

# 先ほど作ったデータごとにまとめたリストからDataframeの作成

# 実行部分

