# 必要なモジュールのimport

'''
メインの実行部分
'''

# yesterday =  datetime.date.today() - datetime.timedelta(1)

# 調べる言語のリストの用意

# for文を使ってリストに入っている言語ごとにデータを取得していく

# 取得したデータからデータフレームを作成

# いいね数の総和を求めてリストに追加

# 言語ごとのいいね数を出力する

# 言語名といいね数の情報からデータフレームを作成する

# いいね数の多い順にデータを並べ変える

# 各種ツイッターのキーをセット

# API利用制限にかかった場合、解除まで待機する


# ツイートを収集する関数


# 検索キーワード。 リツイートは除く

# ツイート取得

# ツイートデータを入れる空のリストを用意

# APIのtweepy.Cursorのキーワードサーチ(api.search)を使う

# いいねとリツイートの合計がrecuont以上なら


'''
ツイートデータを番号と共に出力
'''

"""
ツイートのデータからデータフレームを作成
"""    

# 各ツイートデータを入れるための空のリストを用意

# ツイートの各アイテムを入れるリストを作成

# 上で作成したリストからツイートを入れるデータフレームの作成

# 実行部分
